<script setup>
</script>

<template>
  <div style="margin-top: 20px">
    <p class="first-text my-text text-size1">Полезные статьи</p>
  </div>
  <div
    class="rectangle"
    style="margin-top: 40px; display: flex; justify-content: center; align-items: center"
  >
    <div class="second-text my-text text-size2">
      <p>Что делать, если вы нашли бездомное животное и хотите забрать его к себе?</p>
    </div>
  </div>

  <div style="display: flex; align-items: center; margin-top: 20px">
    <div class="">
      <p class="second-text my-text text-size2" style="margin-bottom: 10px">
        На улицах городов и в парках нередко можно встретить бездомных животных, нуждающихся в
        помощи. Если вы решили забрать такое животное к себе, важно действовать ответственно и
        обдуманно. Вот несколько шагов, которые помогут вам в этом процессе.
      </p>
      <p class="first-text my-text text-size2" style="margin-bottom: 10px">
        1. Оцените состояние животного
      </p>
      <p class="second-text my-text text-size2">
        Прежде всего, убедитесь, что животное в безопасности. Оцените его состояние:<br />Внешний
        вид: Есть ли у животного раны, признаки болезни или истощения?<br />Поведение: Спокойно
        ли оно себя ведет или проявляет агрессию? Возможно, животное испугано и нуждается во
        времени для привыкания к людям.<br />Если вы видите, что животное серьезно травмировано
        или больно, лучше всего обратиться в ветеринарную клинику.
      </p>
    </div>
    <img src="/1.png" alt="1" style="object-fit: cover" />
  </div>
  <div>
    <p class="first-text my-text text-size2" style="margin-bottom: 10px">
      2. Подготовить свой дом
    </p>
    <p class="second-text my-text text-size2">
      Перед тем как забрать животное домой, убедитесь, что ваш дом готов к новому жильцу:
      Создайте безопасное пространство: Отведите отдельное место для животного с лежанкой,
      мисками для еды и воды. Обеспечьте безопасность: Убедитесь, что в доме нет опасных
      предметов и токсичных растений.
    </p>
    <p class="first-text my-text text-size2" style="margin-bottom: 10px">
      3. Визит к ветеринару
    </p>
    <p class="second-text my-text text-size2">
      После того как вы забрали животное домой, обязательно запланируйте визит к ветеринару:
      Проверьте общее состояние здоровья. Сделайте необходимые прививки. Обсудите вопросы
      стерилизации или кастрации.
    </p>
    <p class="first-text my-text text-size2" style="margin-bottom: 10px">
      4. Дайте животному привыкнуть к новому дому
    </p>
    <p class="second-text my-text text-size2">
      Дайте животному время адаптироваться к новым условиям. Будьте терпеливы и осторожны:
      Позвольте ему исследовать пространство. Не заставляйте его общаться, если он этого не
      хочет.
    </p>
    <p class="first-text my-text text-size2" style="margin-bottom: 10px">
      5. Заботьтесь о питомце
    </p>
    <p class="second-text my-text text-size2">
      Обеспечьте животному правильный уход: Кормите сбалансированным кормом. Обеспечьте
      регулярные прогулки (если это собака). Обратите внимание на его эмоциональное состояние и
      потребности.
    </p>
  </div>

  <div
    class="rectangle"
    style="margin-top: 40px; display: flex; justify-content: center; align-items: center"
  >
    <div class="second-text my-text text-size2">
      <p>Как часто нужно кормить котят и щенков?</p>
    </div>
  </div>

  <div style="display: flex; gap: 50px;">
    <div style="display: flex; flex-direction: column;">
      <img src="/2.png" alt="2" style="object-fit: cover; margin-top: 20px; margin-bottom: 10px;" />
      <p class="first-text my-text text-size2" style="margin-bottom: 10px">Как часто нужно кормить котят?</p>
      <p class="second-text my-text text-size2">
        Во-первых, усвойте, что котенком ваш любимец будет месяцев до 9–10, если это девочка, и до 10, если это мальчик. Дальше его ждет половое созревание, и он станет вполне взрослым котом.
        Если вы остановились на пище натуральной, то помните, что в меню маленького любимца обязательно быть должны:
        рыба или мясо – до 150 г (минимум 120);
        кисломолочные продукты – от 30 до 50 г;
        крупы – от 10 до 20 г;
        овощи – 30–50 г;
        дрожжи – половина чайной ложки.
        Котятам до 2 месяцев не рекомендуется давать корма влажные, но можно сухие.
        В полтора месяца «ребенку» нужно 25–35 г корма сухого.
        В 2 месяца на сутки нужно 50 г сухого корма либо 2–2,5 упаковки влажного.
        В 3 месяца дают до 65 г сухого или 3 упаковки корма влажного.
        На 50 корма сухого ребенку нужно около 150 мл воды.
        Итак, в полтора месяца котенка кормят 7 раз в сутки.
        Месяцев с двух кормить можно 5–6 раз. В это время у них формируется окончательно пищеварительная система и появляются молочные зубы, поэтому речь идет не о прикорме, а о полноценном меню. Также в этом возрасте окончательно укрепляется скелет.
        Месяцев с трех–четырех кормить «ребенка» можно четыре раза в сутки, а порции должны быть посолиднее. И наконец, с 6 месяцев можете спокойно переводить его на питание трехразовое. Месяцев с восьми можно кормить котенка как взрослого кота.</p>
    </div>
    <div style="display: flex; flex-direction: column;">
      <p class="first-text my-text text-size2" style="margin-top: 30px; margin-bottom: 10px;">Как часто нужно кормить щенков?</p>
      <p class="second-text my-text text-size2">
        Помните, что с первых дней и до трех недель щенок питается только молоком мамы, это единственный продукт в его рационе. На третьей неделе его начинают отнимать от матери, и длится этот процесс до двух месяцев. желательно не кормить в этот период щенков в присутствии мамы. В это время малышу уже нужен прикорм. В это время доступ к корму должен быть свободный, и особых требований к количеству приемов пищи пока нет. В это время щенок еще живет у заводчика и с мамой. Примерно в этом возрасте его могут начать переводить на собачьи корма. Кстати, первое время их размачивают в молоке мамы, после – в воде.

        Так вот, первое, чем вы должны поинтересоваться у заводчика, это частота кормления щенка. Дальше либо переводить его с натурального питания на корма, если вам удобно, либо наоборот. Это уже ваш выбор, но помните, что этот процесс длиться должен минимум дней 5–7, а лучше недели две.
        Если вы выбрали корм, то нужно учитывать, что щенкам мелких пород нужно давать до 600 г корма эконом-класса в сути, до 400 г корма класса премиум и до 300 г корма класса супер-премиум или холистик в сутки. Для средних пород эти цифры возрастают на 150–200 г в сутки. Щенкам крупным нужно давать до 1200 г корма эконом-класса в сутки, до 900 г корма класса премиум и до 800 г корма холистик или супер-премиум. Помните, что, если корм сухой, нельзя забывать о воде в рационе.

        Также стоит помнить, что у щенка в 4 месяца меняются зубы, а значит, если вы выбрали натуральное питание, то нужно увеличить количество кальция в рационе.

        В возрасте от двух месяцев и до 4, кормить щенков нужно раз в 4 часа, причем первый раз – самым ранним утром. В 4–6 месяцев кормить щенков нужно трижды в стуки. С полугода щенков кормят примерно так же, как взрослую собаку, то есть 2, максимум 3 раза в сутки.</p>
        <img src="/3.png" alt="3" style="object-fit: cover; margin-top: 20px; margin-bottom: 10px;" />
    </div>
  </div>

  <div
    class="rectangle"
    style="margin-top: 40px; display: flex; justify-content: center; align-items: center"
  >
    <div class="second-text my-text text-size2">
      <p>Что нужно купить для собаки?</p>
    </div>
  </div>

  <div style="display: flex; gap: 50px;">
    <div>
      <img src="/4.png" alt="4" style="object-fit: cover; margin-top: 20px; margin-bottom: 10px;" />
    </div>
    <div>
      <p class="second-text my-text text-size2" style="margin-top: 30px">
        1. Адресник с именем собаки и вашими контактами + яркий шнурок для адресника<br>2. Яркая, надёжная и удобная н-образная шлейка<br>3. Поводок (не менее 5 метров), не рулетка<br>4. Миски для воды и еды<br>5. Корм и специальные лакомства<br>6. Шампунь
        7. Расчёска-пуходерка или фурминатор<br>8. Полотенце<br>9. Несколько разных игрушек<br>10. Место для сна (лежак или плед)<br>11. Когтерезка<br>12. Весной и осенью: средства от клещей</p>
    </div>
  </div>

  <div
    class="rectangle"
    style="margin-top: 40px; display: flex; justify-content: center; align-items: center"
  >
    <div class="second-text my-text text-size2">
      <p>Что нужно купить для кошки?</p>
    </div>
  </div>

  <div style="display: flex; gap: 50px; align-items: center">
    <div>
      <p class="second-text my-text text-size2" style="margin-top: 30px">
        1. Адресник с именем кошки и вашими контактами + яркий шнурок для адресника<br>2. Миски для воды и еды<br>3. Корм и специальные лакомства<br>4. Лоток и наполнитель<br>5. Когтеточка<br>6. Шампунь<br>
        Что купить?
        7. Расчёска-пуходерка или фурминатор<br>8. Полотенце<br>9. Несколько разных игрушек<br>10. Место для сна (лежак или плед)<br>11. Средства от блох<br>12. Переноска</p>
    </div>
    <div>
      <img src="/5.png" alt="5" style="object-fit: cover; margin-top: 20px; margin-bottom: 10px;" />
    </div>
  </div>

  <div
    class="rectangle"
    style="margin-top: 40px; display: flex; justify-content: center; align-items: center"
  >
    <div class="second-text my-text text-size2">
      <p>Правила передачи животных из приюта</p>
    </div>
  </div>

  <div style="display: flex; gap: 50px; align-items: center">
    <div>
      <img src="/6.png" alt="6" style="object-fit: cover; margin-top: 20px; margin-bottom: 10px;" />
    </div>
    <div>
      <p class="first-text my-text text-size2" style="margin-top: 30px">
        1. Выберите питомца
      </p>
      <p class="second-text my-text text-size2" style="margin-top: 10px">
        Выберите животного на странице «Каталог животных»  
      </p>
      <p class="first-text my-text text-size2" style="margin-top: 10px">
        2. Свяжитесь с куратором
      </p>
      <p class="second-text my-text text-size2" style="margin-top: 10px">
        Все контакты указаны на странице питомца 
      </p>
      <p class="first-text my-text text-size2" style="margin-top: 10px">
        3. Пройдите собеседование
      </p>
      <p class="second-text my-text text-size2" style="margin-top: 10px">
        Познакомьтесь с куратором и питомцем лично в приюте
      </p>
      <p class="first-text my-text text-size2" style="margin-top: 10px">
        4. Заберите питомца домой
      </p>
      <p class="second-text my-text text-size2" style="margin-top: 10px">
        Теперь в вашей жизни есть лучший друг!<br>
        Только обязательно возьмите с собой паспорт
      </p>
    </div>
  </div>

  <div
    class="rectangle"
    style="margin-top: 40px; display: flex; justify-content: center; align-items: center"
  >
    <div class="second-text my-text text-size2">
      <p>Какие прививки нужно делать собакам каждый год?</p>
    </div>
  </div>

  <div style="display: flex;align-items: center">
    <div style="display: flex; align-items: center; gap: 40px;">
      <div style="display: flex; flex-direction: column;">
        <p class="first-text my-text text-size2" style="margin-top: 30px">Щенки</p>
        <p class="second-text my-text text-size2" style="margin-top: 10px; max-width: 800px;">
          Щенки получают иммунитет во время кормления молоком матери, который ослабевает на протяжении первых нескольких месяцев жизни. Чтобы защитить щенков в этот критический период существует серия вакцин, которые делаются каждые 3-4 недели пока шанс заболеть инфекционными заболеваниями минимальный. Типичная вакцина — это комбинация от вирусов бешенства, аденовируса, парагриппозного вируса и парвовирусного энтерита (аббревиатура из 4 компонент — DHPP). Многие ветеринары также рекомендуют включить в состав прививки от лептоспироза (аббревиатура из 5 компонент — DHLPP). Прививка от бешенства делается между 16 и 26 неделью жизни.</p>
      </div>
      <div>
        <img src="/7.png" alt="7" style="object-fit: cover; margin-top: 20px; margin-bottom: 10px;" />
      </div>
    </div>
  </div>
  <div>
    <p class="first-text my-text text-size2" style="margin-top: 10px">
      Собаки возрастом от 20 недель и до 2-х лет
    </p>
    <p class="second-text my-text text-size2" style="margin-top: 10px">
      Молодым взрослым собакам проводят ревакцинацию для обеспечения пожизненного иммунитета от смертельно опасных вирусов. Ваш ветеринар скорее всего будет ревакцинировать против чумки, аденовируса, парагриппа и парвовируса (DHPP). Многие ветеринары также рекомендуют дополнительно вакцины от лептоспироза (DHLPP). Многих собак вакцинируют от бактериальных инфекций (от бордетеллы возбудителя коклюша и лептоспироза). Иммунизация от этих заболеваний обычно не устойчива более года, поэтому целесообразно делать ее ежегодно. Вакцину от бордетеллы советуют делать собакам, часто посещающим парки, выставки собак и соревнование по аджилити. Вакцину от бешенства делают согласно планового графика прививок. В некоторых местах проживания важна вакицина против специфических форм бактерии лептоспироза.
    </p>
    <p class="first-text my-text text-size2" style="margin-top: 10px">
      Взрослые собаки старше 3-х лет
    </p>
    <p class="second-text my-text text-size2" style="margin-top: 10px">
      Ежегодную ревакцинацию рекомендуют проводить сразу же после первого года после «щенячьего» возраста, после чего вам необходимо обсудить выгоды и факторы риска ежегодной ревакцинации со своим ветеринаром. В прошлом, DHLP вакцина (чумка, гепатит, лептоспироз, парвовирус) делалась ежегодно. Однако, данные рекомендации уже устарели. Американская ассоциация ветеринарных лечебниц (AAHA) издала новые рекомендации в 2006 году, согласно которым взрослым собакам вакцины делаются каждые 3 года. И только в отдельных случаях специальные вакцины требуют индивидуального подхода к конкретной собаке, что также необходимо обсуждить с ветеринаром. Наиболее подходящая программа вакцинации вашего питомца должна быть следющей: Итак, если риск заразиться коклюшем высок, тогда рекомендуется вакцина против бордетеллы, которую необходимо делать дважды в год, и каждый год вам и вашему ветеринару нужно будет оценивать необходимость данной вакцины.
      Вакцина от бешенства делают согласно графика прививок. Необходимость в прививке от лептоспироза обуславливется местностью, в которой живете и стилю жизни вашего питомца, делается один раз или дважды в год. Другие вакцины от таких заболеваний как коронавирусы, болезни Лайма и лямблиоза, делаются не в плановом порядке и в любом случае обсуждаются с вашим ветеринаром. Согласно рекомендациям Американской ассоциации ветеринарных лечебниц (AAHA) в 2006 году вакцины от коронавируса и лямблиоза не рекомендуются делать ни в каком возрасте. Вакцину от болезни Лайма (от клещевого боррелиоза) следует делать только тем живоным, которые живут в опеределенной местности, где риск заболевания высок. Существуют еще другая возможность определения необходимости в каких-либо прививках — с помощью определения титров в крови животного. Если у вашей взрослой собаки была неадекватная реакция на прививку (температура, рвота, тремор, отек или сыпь) обсудите целесообразность дальнейшей ежегодной ревакцинации с вашим ветеринаром.
    </p>
  </div>

  <div
    class="rectangle"
    style="margin-top: 40px; display: flex; justify-content: center; align-items: center"
  >
    <div class="second-text my-text text-size2">
      <p>Лучшие варианты корма для кошек и собак</p>
    </div>
  </div>

  <div style="display: flex; flex-direction: column;">
    <div style="display: flex; margin-top: 30px;">
      <div>
        <img src="/8.png" alt="8" style="object-fit: cover; margin-top: 20px; margin-bottom: 10px;" />
      </div>
      <div>
        <p class="first-text my-text text-size2">Лучшие марки кошачьих сухих холистиков:</p>
        <p class="second-text my-text text-size2">
          Pronature Holistic;<br>
          AATU;<br>
          Farmina ND;<br>
          Alleva;<br>
          Primordial;<br>
          Grandorf;<br>
          ProNature;<br>
          Elato Holistic;<br>
          NOW FRESH;<br>
          Bon Appetit;<br>
          Almo Nature Holistic.
        </p>
      </div>
      <div>
        <p class="first-text my-text text-size2">Лучшие влажные корма-холистики для кошек:</p>
        <p class="second-text my-text text-size2">
          CLAN De File;
          Prime Ever;<br>
          Landor ;<br>
          Almo Nature;<br>
          Acana Regionals Pacifica Cat Grain Free;<br>
          Grandorf;<br>
          Berkley;<br>
          Solid Natura Holistic;<br>
          Boreal;<br>
          «Ламистер»;<br>
          «Зоогурман Holistic»;<br>
          ONTO;<br>
          «Мнямс»;<br>
          «Ночной охотник».
        </p>
      </div>
    </div>
    <div style="display: flex; margin-top: 10px;">
      <div>
        <p class="first-text my-text text-size2" style="max-width: 600px;">Топ-10 рейтинг кормов премиум класса для собак по соотношению «цена/качество»:</p>
        <p class="second-text my-text text-size2">
          Brit Premium by Nature<br>
          Grand Prix<br>
          Monge<br>
          Optimeal<br>
          Meglium<br>
          Florida<br>
          Probalance<br>
          Blitz<br>
          Sirius<br>
          Acari Ciar<br>
        </p>
      </div>
      <div>
        <img src="/9.png" alt="9" style="object-fit: cover; margin-top: 20px; margin-bottom: 10px;" />
      </div>
    </div>
  </div>

  <div
    class="rectangle"
    style="margin-top: 40px; display: flex; justify-content: center; align-items: center"
  >
    <div class="second-text my-text text-size2">
      <p>Как подготовиться к появлению животного в новом доме?</p>
    </div>
  </div>

  <div style="display: flex; gap: 50px; margin-top: 30px">
    <div style="display: flex; flex-direction: column;">
      <p class="first-text my-text text-size2" style="margin-bottom: 10px;">Если вы берете собаку</p>
      <p class="second-text my-text text-size2">
        Вы готовы стать ответственным владельцем собаки, если:
        1. Все члены вашей семьи согласны принять нового питомца.
        2. Вы обговорили с родными условия содержания собаки, распределили обязанности (кто будет гулять, кормить, вычесывать, дрессировать, убирать за собакой), совместно решили, что будет разрешено делать собаке в доме (в квартире, в машине), а что нельзя (например, можно будет спать на постели или исключительно на лежанке, заходить в определенные комнаты, лаять на звонок, приносить домой с прогулки палки и т.д.). Конечно, какие-то привычки будут проявляться позже, во время адаптации животного, но основные правила содержания собаки в вашей семье вы должны обговорить заранее. Рекомендуем ознакомиться со статьями в разделе «Школа ответственных хозяев», которые также помогут получить необходимые знания по уходу за животным.
        3. Все провода, идущие по полу, убраны или спрятаны в специальные короба.
        4. Хрупкие предметы, которые стояли у вас на полу или на нижних полках, убраны или переставлены выше.
        5. Обувь убрана в обувные шкафы.
        6. Горшки с цветами, стоящие на полу, переставлены в недоступные для собаки места.
        7. Подготовлены места, где будет находиться лежанка для собаки, место для миски с кормом и водой, а также определено место, где вы будете хранить корм.
        8. Если вы живете в частном доме, вы проверили вашу территорию, убрали потенциально опасные предметы, которые может проглотить питомец или о которые он может пораниться (железки, куски дерева, пластик). А также внимательно проверили забор, огораживающий ваш участок на наличие гвоздей, отверстий или возможности для подкопа.
        Всё это о том, как подготовить квартиру к появлению щенка, если вся работа проведена, всё убрано и спрятано, то вы готовы к появлению щенка в доме.
      </p>
      <img src="/11.png" alt="11" style="object-fit: cover; margin-top: 20px; margin-bottom: 10px;" />
    </div>
    <div style="display: flex; flex-direction: column;">
      <img src="/10.png" alt="10" style="object-fit: cover; margin-top: 20px; margin-bottom: 10px;" />
      <p class="first-text my-text text-size2" style="margin-bottom: 10px;">Если вы берете кошку</p>
      <p class="second-text my-text text-size2">
        Как подготовиться к появлению котенка в квартире?
        Ваш дом полностью готов принять кота или кошку, если:
        1. Все члены вашей семьи согласны принять нового питомца.
        2. Вы обговорили с родными условия содержания кошки, распределили обязанности (кто будет кормить, вычесывать, играть, убирать за животным). Советы по содержанию кошки можно найти в разделе «Школа ответственных хозяев».
        3. Все провода, идущие по полу, убраны или спрятаны в специальные короба.
        4. Хрупкие предметы на полу и на открытых полках убраны или переставлены в недоступные для кошки места.
        5. Горшки с цветами проверены на наличие ядовитых растений.
        6. Подготовлены места, где будет находиться лежанка или домик для кошки, игрушки, когтеточка, место для мисок, а также определено место, где вы будете хранить корм.
        7. Вы поставили на окна защитные сетки «Антикошка», которые позволят вам спокойно проветривать помещения, не боясь, что ваш пушистый питомец выпадет из окна.
        8. Если вы живете в частном доме, вы проверили вашу территорию, убрали потенциально опасные предметы, которые может проглотить или о которые может пораниться ваш котенок или взрослая кошка (железки, куски дерева, пластик).
        9. Если вы планируете выпускать кошку на прогулку одну на участке, вы построили ей большой вольер, где она сможет гулять и при этом находиться в безопасности.
      </p>
    </div>
  </div>
</template>

<style>
.rectangle {
  max-width: 2000px;
  height: 80px;
  border-radius: 15px;
  background-color: white;
  box-shadow: 5px 5px 15px rgba(0, 0, 0, 0.3);
  padding: 20px 30px;
  border: 1px solid rgb(67, 85, 56);
}
.circle {
  width: 51px;
  height: 51px;
  border-radius: 50%;
  display: flex;
  align-items: center;
  justify-content: center;
  background-color: rgb(67, 85, 56);

}
.arrow {
  transition: transform 0.3s ease;
}

.collapse {
  display: grid;
  grid-template-rows: 0fr;
  overflow: hidden;
  transition: height 200ms eas;
}
.collapse.clicked {
  grid-template-rows: 1fr;
}
/* transform: rotate(180deg);
  transition: opacity 0.5s;
  opacity: 0; */
</style>
